Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/state_examinations/junior_certificate_programme.html.txt.tmx
Source language: en
Languages: ga

source: The Junior Certificate examination is held at the end of the Junior Cycle in post-primary schools
ga: Reáchtáltar scrúdú an Teastais Shóisearaigh ag deireadh na Sraithe Sóisearaí in iar-bhunscoileana

source: The Junior Cycle caters for students aged from 12 to 15 years and students normally sit the exam at the age of 14 or 15, after 3 years of post-primary education
ga: Déanann daltaí idir 12 agus 15 freastal ar an tSraith Shóisearach agus is iondúil go seasann daltaí an scrúdú agus iad 14 nó 15 bliana d’aois agus trí bliana d’oideachas iar-bhunscoile faighte acu

source: However, the Junior Certificate is not limited to post-primary school students
ga: Ina dhiaidh sin féin, ní do dhaltaí iar-bhunscoile amháin an Teastas Sóisearach

source: A candidate following an approved course of study outside the State or who is attending an approved course of study organised under the Vocational Training Opportunities Scheme, adult literacy and community education schemes, the Department of Social Protection's Back to Education scheme for the unemployed or a similar scheme, may also sit the exams
ga: Is féidir le hiarrthóir atá ag leanacht chúrsa ceadaithe taobh amuigh den Stát nó atá ag freastal ar chúrsa staidéir ceadaithe arna rith faoi Scéim Deiseanna Gairmoiliúna, scéimeanna litearthachta d’aosaigh agus Scéimeanna Oideachais Pobail, scéim dara leibhéal na Roinne Coimirce Sóisialaí do dhaoine dífhostaithe nó scéim dá leithéid na scrúduithe a sheasamh chomh maith

source: There is information about continuing education schemes elsewhere on this website
ga: Tá tuilleadh eolais faoi na scéimeanna le fáil

source: Changes to the Junior Cycle
ga: Athruithe ar an tSraith Shóisearach

source: The Junior Certificate will be replaced with the Junior Cycle Student Award (JCSA)
ga: Ionadófar an Teastas Sóisearach le Gradam Scoláire na Sraithe Sóisearaí (JCSA)

source: There will be a school-work component to the assessment which will be based on work completed by the student during second and third year
ga: Beidh comhpháirt oibre scoile i gceist leis an measúnacht a bheidh bunaithe ar obair a chuir an dalta i gcrích sa dara bliain agus sa tríú bliain

source: Students in second year will sit standardised tests in Maths and English reading (or Irish reading in Irish-medium schools)
ga: Déanfaidh daltaí sa dara bliain trialacha caighdeánaithe i Matamaitic agus i léitheoireacht Bhéarla (nó i léitheoireacht Ghaeilge i nGaelscoileanna)

source: Standardised testing in Science will also be included
ga: Cuirfear triail chaighdeánaithe in Eolaíocht san áireamh freisin

source: The National Council for Curriculum and Assessment is developing a new report card for parents which will give them much more information about their son or daughter’s learning progress
ga: Tá cárta tuairisce nua do thuismitheoirí á fhorbairt ag an gComhairle Náisiúnta Curaclaim agus Measúnachta lena dtabharfar níos mó faisnéise dóibh faoi dhul chun cinn foghlama a mic nó a n-iníne

source: More information about the changes to the Junior Cycle is available on the Department of Education’s website
ga: Tá tuilleadh faisnéise faoi na hathruithe ar an tSraith Shóisearach ar fáil ar láithreán Gréasáin na Roinne Oideachais

source: There is a wide range of subjects available, but all subjects are not offered in every school
ga: Tá raon leathan ábhar ar fáil, ach ní thairgtear gach ábhar i ngach scoil

source: The Department of Education and Skills publishes syllabus and curriculum information
ga: Foilsíonn an Roinn Oideachais agus Scileanna faisnéis siollabais agus churaclaim

source: The National Council for Curriculum and Assessment provides a list of Junior Certificate subjects
ga: Cuireann an Chomhairle Náisiúnta Curaclaim agus Measúnachta liosta d’ábhair Theastais Shóisearaigh ar fáil

source: All students must follow courses in Irish (except where exemptions apply), English, Mathematics and Civic, Social and Political Education
ga: Ní mór do gach dalta leanúint le cúrsaí i nGaeilge (gan cásanna ina bhfuil díolúintí i bhfeidhm a áireamh), i mBéarla, i Matamaitic agus in Oideachas Saoránach, Sóisialta agus Polaitiúil

source: There may be other compulsory subjects, depending on the type of school
ga: Is féidir gurb ann d’ábhair éigeantacha eile, ag brath ar an gcineál scoile

source: Examinations in a number of other EU languages are offered to students who meet certain criteria
ga: Tairgtear scrúduithe i roinnt de theangacha eile an AE do dhaltaí a chomhlíonann critéir áirithe

source: │Percentage Range │Grade │
ga: │Raon céatadáin │Grád │

source: │85 or over │A │
ga: │85 nó níos mó │A │

source: │70 but less than 85 │B │
ga: │70 ach níos lú ná 85 │B │

source: │55 but less than 70 │C │
ga: │55 ach níos lú ná 70 │C │

source: │40 but less than 55 │D │
ga: │40 ach níos lú ná 55 │D │

source: │25 but less than 40 │E │
ga: │25 ach níos lú ná 40 │E │

source: │10 but less than 25 │F │
ga: │10 ach níos lú ná 25 │F │

source: │Less than 10 │No Grade │
ga: │Níos lú ná 10 │Gan Ghrád │

source: You can find the timetables for the Junior Certificate written examinations (pdf) and for the practical course work (pdf) as well as the Junior Certificate examination papers on the website of the State Examinations Commission
ga: Is féidir leat na cláir ama le haghaidh scrúduithe scríofa an Teastais Shóisearaigh (pdf) agus le haghaidh na hoibre cúrsa praiticiúla (pdf) mar aon le scrúdpháipéir an Teastais Shóisearaigh a fháil ar láithreán Gréasáin Choimisiún na Scrúduithe Stáit

source: Students sitting for the Junior Certificate must pay an examination fee
ga: Ní mór do dhaltaí atá ag seasamh an Teastais Shóisearaigh táille an scrúdaithe a íoc

source: In early February of the exam year, the school sends parents who are paying the examination fee a form
ga: I Feabhra don bhliain scrúdaithe seolann an scoil foirm chuig na tuismitheoirí atá ag íoc na táille

source: The parent makes the payment through a bank and the bank must stamp the form
ga: Íocann tuismitheoir an táille tríd an mbanc agus ní mór stampa an bhainc a bheith ar an bhfoirm

source: The parent then returns the form to the school
ga: Seolann an tuismitheoir an fhoirm ar ais chuig an scoil ansin

source: Students whose parent or guardian holds a current medical card do not have to pay the fee
ga: Ní gá do dhaltaí a bhfuil a dtuismitheoir nó a gcaomhnóir i seilbh chárta leighis an táille a íoc

source: In the case of parents who have a current medical card, details of the medical card are put on the form and the parent then sends the form back to the school
ga: Sa chás go bhfuil cárta leighis reatha ag tuismitheoirí, líontar sonraí faoin gcárta leighis ar an bhfoirm agus seolann an tuismitheoir an fhoirm ar ais chun na scoile ansin

source: The examination fee for the Junior Certificate in 2017 is €109
ga: Is ionann táille scrúdaithe an Teastais Shóisearaigh in 2017 €109

source: The examination fee for VTOS (Vocational Training Opportunities Scheme) and similar students is as follows:
ga: Seo a leanas an táille scrúdaithe i gcás dhaltaí SDGO (Scéim Deiseanna Gairmoiliúna) agus a leithéidí:

source: • Mix of Leaving Certificate/Junior Certificate subjects (3+) is €116
ga: • Meascán d’ábhair Ardteistiméireachta agus Teastais Shóisearaigh (3+): €116

source: • Junior Certificate (3+ subjects) is €109
ga: • An Teastas Sóisearach (3+ ábhar): €109

source: • 1 or 2 subjects - Leaving Certificate or Junior Certificate or mix of both is €71
ga: • 1 nó 2 ábhar - AT/TS/meascán den phéire: €71

source: The State Examinations Commission manages and adminsters the State Certificate Examinations including the:
ga: Is é Coimisiún na Scrúduithe Stáit a dhéanann bainistíocht agus riarachán ar Scrúduithe Teastais an Stáit, ina measc:

source: • Leaving Certificate Vocational Programme
ga: • Clár Gairme na hArdteistiméireachta

source: Appealing your results: If you wish to appeal your examination results, you should apply through your school
ga: Achomharc a dhéanamh in aghaidh do thorthaí: más mian leat achomharc a dhéanamh in aghaidh do thorthaí scrúduithe, caithfidh tú iarratas trí do scoil a dhéanamh

source: The appeal fee is €32 per subject which is refunded if your result is upgraded
ga: Is an táille achomharc é €32 an t-ábhar agus má tá do thorthaí uasghrádaithe beidh an táille aisíoctha duit

source: To request a certified statement of examination results you can either apply in writing or download and complete the application form
ga: Más mian leat ráiteas deimhnithe faoi thorthaí scrúdaithe a iarraidh, is féidir sin a dhéanamh i scríbhinn nó foirm iarratais a íoschóipeáil agus a líonadh isteach

source: Your application should specify the following personal details:
ga: Ba cheart go dtabharfaí na sonraí pearsanta seo a leanas i d’iarratas:

source: • Name at the time of the examination (if different)
ga: • Ainm tráth an scrúdaithe (murar ionann sin agus d’ainm anois)

source: • Name and address of school attended
ga: • Ainm agus Seoladh na Scoile ar ar freastalaíodh

source: • Examination number (if known)
ga: • Scrúduimhir (más eol duit í)

source: Forward your completed application form together with the appropriate fee to the State Examinations Commission
ga: Seoltar an fhoirm iarratais líonta maraon leis an táille chuí go dtí Coimisiún na Scrúduithe Stáit
